In [ ]:
## 모듈 로딩
import pandas as pd

In [ ]:
## read_csv() 함수로 파일 읽어와서 df로 변환
df = pd.read_csv('./data/stock-data.csv')
df2 = df.copy()

## 문자열인 날짜 데이터를 판다스 Timestamp로 변환
df2['new_Date'] = pd.to_datetime(df2['Date'])   #df에 새로운 열로 추가
df2.head()
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   new_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [ ]:
## dt 속성을 이용하여 new_Date 열의 년월일 정보를 년, 월, 일로 구분
df2['Year']  = df2['new_Date'].dt.year
df2['Month'] = df2['new_Date'].dt.month
df2['Day']   = df2['new_Date'].dt.day
df2.head()

         Date  Close  Start   High    Low  Volume   new_Date  Year  Month  Day
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [ ]:
# Timestamp를 Period로 변환하여 년월일 표기 변경
df3 = df.copy()
df3['new_Date'] = pd.to_datetime(df2['Date']) 
df3['Date_yr'] = df3['new_Date'].dt.to_period(freq='Y')
df3['Date_m']  = df3['new_Date'].dt.to_period(freq='M')
df3.head()

         Date  Close  Start   High    Low  Volume   new_Date Date_yr   Date_m
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02    2018  2018-07
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29    2018  2018-06
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28    2018  2018-06
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27    2018  2018-06
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26    2018  2018-06

In [ ]:
# 2018년 6월 데이터만 추출 (문자열 속성 활용)
df_june = df3[df3['Date_m'].astype(str).str.fullmatch('2018-06')]
df_june.head()

         Date  Close  Start   High    Low  Volume   new_Date Date_yr   Date_m
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29    2018  2018-06
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28    2018  2018-06
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27    2018  2018-06
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26    2018  2018-06
5  2018-06-25  11150  11400  11450  11000   55519 2018-06-25    2018  2018-06

In [ ]:
# 2018년 6월 데이터만 추출 (Period 객체 활용)
df_june2 = df3[df3['Date_m'] == pd.Period('2018-06')]
df_june2.head()

         Date  Close  Start   High    Low  Volume   new_Date Date_yr   Date_m
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29    2018  2018-06
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28    2018  2018-06
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27    2018  2018-06
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26    2018  2018-06
5  2018-06-25  11150  11400  11450  11000   55519 2018-06-25    2018  2018-06

In [ ]:
# 원하는 열을 새로운 행 인덱스로 지정
df_june = df_june.set_index('new_Date')
df_june.head()

                  Date  Close  Start   High    Low  Volume Date_yr   Date_m
new_Date
2018-06-29  2018-06-29  10700  10550  10900   9990  170253    2018  2018-06
2018-06-28  2018-06-28  10400  10900  10950  10150  155769    2018  2018-06
2018-06-27  2018-06-27  10900  10800  11050  10500  133548    2018  2018-06
2018-06-26  2018-06-26  10800  10900  11000  10700   63039    2018  2018-06
2018-06-25  2018-06-25  11150  11400  11450  11000   55519    2018  2018-06